# IndexBuffer Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IndexBuffer Properties
IndexBuffer Class See Also
---
The IndexBuffer type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
IndexBuffer Class
Autodesk.Revit.DB.DirectContext3D Namespace